AmazingAndrew/pc-controller/sdkconfig.defaults
# --- 目标芯片 ---
CONFIG_IDF_TARGET="esp32c3"
# 注:ESP32-C3 无 PSRAM,故不设 CONFIG_SPIRAM。

# --- Flash ---
# FoloToy AI Passport 当前产品/固件基线使用 8MB Flash。
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# 固定 8MB 镜像头，关闭 detect，便于 idf.py merge-bin。
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=n
# 3 MB 应用上限与小程序 BLE Recovery 安装器保持一致。分区表
# 还固定保留 cardid@0x356000 与 recovery@0x700000，二创不得改动。
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# 开机持续按住上键（GPIO0）5 秒，由自定义 bootloader 跳转到工厂
# 预装的 0x700000 Recovery。这些选项为 bootloader 提供长按检测配置。
CONFIG_BOOTLOADER_FACTORY_RESET=y
CONFIG_BOOTLOADER_NUM_PIN_FACTORY_RESET=0
CONFIG_BOOTLOADER_FACTORY_RESET_PIN_LOW=y
CONFIG_BOOTLOADER_OTA_DATA_ERASE=y
CONFIG_BOOTLOADER_DATA_FACTORY_RESET=""
CONFIG_BOOTLOADER_HOLD_TIME_GPIO=5

# --- 控制台:USB-Serial-JTAG(C3 原生 USB,GPIO18/19)---
# 不用 UART0:其默认 TX=GPIO21 与本板背光引脚冲突。
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- LVGL ---
CONFIG_LV_COLOR_DEPTH_16=y
# 关闭 LVGL 内部 SW 渲染对 swapped RGB565 格式的支持,
# 避免 .flags.swap_bytes=true 在 esp_lvgl_port 的 flush 回调里
# 再做一次 lv_draw_sw_rgb565_swap 时出现双重转换/颜色异常。
# 仅保留常规 RGB565 blend 函数,字节序由 port 层单点处理。
# CONFIG_LV_DRAW_SW_SUPPORT_RGB565_SWAPPED is not set
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
# PC Controller 仪表/HUD 表达使用 8px 占位字体(主面板标签、电池
# 百分比、底栏键名、角标等位置,主档文档中多处以 lv_font_unscii_8
# 作为 placeholder)。只有 presenter 档需要,默认 demo 不启。
CONFIG_LV_FONT_UNSCII_8=y
# 启用 LVGL snapshot API (任务 #46 串口截屏依赖):
#   lv_snapshot_take() / lv_draw_buf_destroy();
# 启用后 LVGL 内部会按需分配/释放 draw_buf (240×320×2 ≈ 153 KB)。
# 关闭后任务 #46 的快照路径在编译期被排除 (#if LV_USE_SNAPSHOT
# 包围),保留 SDK 中调用可直接编译进 #error 块;此处开启
# 以保证 sdkconfig 升级时的可选性。
CONFIG_LV_USE_SNAPSHOT=y
# LVGL 内置 malloc 池大小(KB)。它是独立静态区、不与系统堆共享,配大了会白白占用 RAM。
# 演示档使用 24KB 足够；PC Controller (presenter) HUD/动画/状态切换较多，扩到 32KB。
# 若自建复杂界面出现绘制卡死/看门狗,继续调大此值,但要注意无 PSRAM 的 C3 内存预算。
CONFIG_LV_MEM_SIZE_KILOBYTES=32

# LCD byte swap: 当前批次实测需 false（LVGL 小端直接匹配 SPI 大端）
# 大多数 ST7789 批次需 true，更换面板时需重新实测
CONFIG_BSP_LCD_SWAP_BYTES=n

# --- 系统 ---
CONFIG_FREERTOS_HZ=1000

# --- Bluetooth LE / NimBLE ---
# ESP32-C3 仅支持 BLE；示例只启用单连接 peripheral 所需的最小 host 配置。
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_HOST_BASED_PRIVACY=n
CONFIG_BT_NIMBLE_NVS_PERSIST=y

# --- PC Controller (presenter) ---
# Build-profile selector. Kept as a config symbol for downstream consumers that
# inspect sdkconfig; the legacy if(CONFIG_PC_CONTROLLER_APP) branch in
# main/CMakeLists.txt has been removed, so all PC Controller sources are
# compiled unconditionally alongside the demo sources.
# Basis: docs/software-design/pc-controller/requirements.md §2.
CONFIG_PC_CONTROLLER_APP=y

# Wi-Fi is not used by the BLE HID presenter; disabling it releases roughly
# 30-50 KB of RAM that the memory budget in requirements.md §9 relies on.
CONFIG_ESP_WIFI_ENABLED=n

# NimBLE Security Manager: legacy pairing + Secure Connections are required for
# the Passkey Entry pairing flow and bond management.
# Basis: requirements.md §2 (NimBLE Security Manager) and FR-07/FR-08.
CONFIG_BT_NIMBLE_SM_LEGACY=y
CONFIG_BT_NIMBLE_SM_SC=y

# Power management: light-sleep prerequisites of the power sub-state machine
# (dim -> screen off -> light sleep -> deep sleep).
# Basis: requirements.md §6 power FSM and FR-10.
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
